
    //كتب هذا الكود عشان نقدر نطلع البيانات الموجودة في البوست مان 
    let request = new XMLHttpRequest()
    // ال اكسمل اشتتب الخ هو عبارة عن كلاس نسوي منه اوبجيكت ونستخدم الخواص الموجودة فيه
        request.open("GET","https://jsonplaceholder.typicode.com/posts")
        // اوبين وحدة من الدوال الموجودة في هذا الكلاس وظيفتها تجهز لك الطلب ونوع الطلب قيت بوست الخخ
        request.responseType = "json"
        //هذي وظيفتها تحدد نوع البيانات الموجودة سواء كان جسون او بوست او قيت اهم شي يكون انت تقدر تتحكم فيه
        request.send()
        //سيند هي دالة موجودة فالكلاس الي شغالين عليه وفايدها انه يقرا الي انت كتبتة في الاوبين  ويرسلة 
        request.onreadystatechange = function (){
        //هنا كتبنا اوريدي هذي تعني ان الطلب او الريسوبس في حال تغييرة يكون مستعد ومتجهز لها وما يقبل قيمة الا دالة او فنكشن   
        //وفيه دالة ثانية اسمها اونلوود في حال انت كتبت الكود فالحال يمشي معك  
             let posts = request.response 
                     // البوست ريكويست هي النتيجه فنحطها في متغير عشان نتحكم فيها 
             for(post of posts){
                // قلنا نخلي المتغير حق الريسبونس داخل متغير فاللوب هذا باسم بوست ونطبعه 
                //console.log(post)
                // هنا تم طباعه كل المصفوفات الموجودة ويمكنك تحديد شي معين داخل المفوفه باستخدام اسمها مثال
                // console.log(post.title) يقوم بطباعة فقط العنوان 
                document.getElementById("content").innerHTML += `<h1>${post.title}</h1>`
                console.log(post.title)
             }
    
        }
    